In [2]:
import pandas as pd
df = pd.read_csv("Location.csv")
df.head()

      Location
0   Location 3
1   Location 6
2   Location 8
3  Location 26
4  Location 34

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1043 entries, 0 to 1042
Data columns (total 1 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Location  1043 non-null   object
dtypes: object(1)
memory usage: 8.3+ KB

In [11]:
df["Location"].describe()

count            1043
unique            296
top       Location 25
freq               31
Name: Location, dtype: object

In [5]:
type(df)

pandas.core.frame.DataFrame

In [42]:
df.dtypes

Location    object
dtype: object

In [23]:
df.nunique()[0]

296

In [12]:
df["Location"].unique()

array(['Location 3', 'Location 6', 'Location 8', 'Location 26',
       'Location 34', 'Location 25', 'Location 46', 'Location 156',
       'Location 21', 'Location 13', 'Location 579', 'Location 602',
       'Location 10', 'Location 44', 'Location 30', 'Location 48',
       'Location 196', 'Location 64', 'Location 91', 'Location 62',
       'Location 75', 'Location 42', 'Location 233', 'Location 95',
       'Location 78', 'Location 61', 'Location 87', 'Location 19',
       'Location 115', 'Location 350', 'Location 377', 'Location 17',
       'Location 113', 'Location 81', 'Location 58', 'Location 212',
       'Location 53', 'Location 337', 'Location 41', 'Location 632',
       'Location 73', 'Location 214', 'Location 218', 'Location 38',
       'Location 172', 'Location 197', 'Location 101', 'Location 185',
       'Location 129', 'Location 235', 'Location 142', 'Location 50',
       'Location 76', 'Location 11', 'Location 33', 'Location 22',
       'Location 145', 'Location 203', 'Location 94', 'Location 573',
       'Location 27', 'Location 186', 'Location 4', 'Location 70',
       'Location 45', 'Location 262', 'Location 111', 'Location 84',
       'Location 108', 'Location 7', 'Location 74', 'Location 450',
       'Location 47', 'Location 37', 'Location 43', 'Location 286',
       'Location 89', 'Location 24', 'Location 97', 'Location 144',
       'Location 40', 'Location 128', 'Location 169', 'Location 399',
       'Location 23', 'Location 191', 'Location 178', 'Location 510',
       'Location 600', 'Location 188', 'Location 67', 'Location 49',
       'Location 29', 'Location 222', 'Location 386', 'Location 88',
       'Location 104', 'Location 405', 'Location 114', 'Location 259',
       'Location 182', 'Location 12', 'Location 228', 'Location 149',
       'Location 90', 'Location 109', 'Location 441', 'Location 421',
       'Location 641', 'Location 195', 'Location 20', 'Location 161',
       'Location 117', 'Location 200', 'Location 106', 'Location 31',
       'Location 122', 'Location 541', 'Location 495', 'Location 193',
       'Location 39', 'Location 9', 'Location 86', 'Location 107',
       'Location 198', 'Location 318', 'Location 135', 'Location 177',
       'Location 32', 'Location 591', 'Location 488', 'Location 418',
       'Location 587', 'Location 454', 'Location 543', 'Location 489',
       'Location 60', 'Location 52', 'Location 548', 'Location 15',
       'Location 240', 'Location 658', 'Location 209', 'Location 151',
       'Location 192', 'Location 364', 'Location 18', 'Location 503',
       'Location 482', 'Location 460', 'Location 71', 'Location 69',
       'Location 258', 'Location 204', 'Location 124', 'Location 168',
       'Location 35', 'Location 296', 'Location 136', 'Location 28',
       'Location 153', 'Location 99', 'Location 132', 'Location 427',
       'Location 118', 'Location 127', 'Location 159', 'Location 154',
       'Location 175', 'Location 120', 'Location 82', 'Location 152',
       'Location 56', 'Location 282', 'Location 566', 'Location 365',
       'Location 353', 'Location 66', 'Location 2', 'Location 323',
       'Location 473', 'Location 206', 'Location 57', 'Location 68',
       'Location 166', 'Location 1', 'Location 227', 'Location 79',
       'Location 642', 'Location 105', 'Location 644', 'Location 547',
       'Location 637', 'Location 59', 'Location 574', 'Location 529',
       'Location 554', 'Location 275', 'Location 589', 'Location 160',
       'Location 410', 'Location 146', 'Location 221', 'Location 265',
       'Location 569', 'Location 157', 'Location 648', 'Location 165',
       'Location 651', 'Location 266', 'Location 77', 'Location 158',
       'Location 336', 'Location 72', 'Location 463', 'Location 253',
       'Location 5', 'Location 431', 'Location 515', 'Location 226',
       'Location 140', 'Location 110', 'Location 202', 'Location 634',
       'Location 138', 'Location 217', 'Location 443', 'Location 627',
       'Location 123', 'Location 528', 'Location 357', 'Location 187',
       'Location 315', 'Location 112', 'Location 302', 'Location 194',
       'Location 332', 'Location 208', 'Location 179', 'Location 199',
       'Location 201', 'Location 174', 'Location 474', 'Location 184',
       'Location 63', 'Location 512', 'Location 403', 'Location 436',
       'Location 210', 'Location 468', 'Location 464', 'Location 98',
       'Location 102', 'Location 325', 'Location 267', 'Location 173',
       'Location 617', 'Location 141', 'Location 300', 'Location 216',
       'Location 506', 'Location 647', 'Location 402', 'Location 239',
       'Location 54', 'Location 137', 'Location 477', 'Location 586',
       'Location 472', 'Location 374', 'Location 458', 'Location 180',
       'Location 653', 'Location 16', 'Location 612', 'Location 505',
       'Location 631', 'Location 299', 'Location 65', 'Location 342',
       'Location 155', 'Location 511', 'Location 461', 'Location 244',
       'Location 207', 'Location 597', 'Location 352', 'Location 533',
       'Location 384', 'Location 80', 'Location 171', 'Location 143',
       'Location 576', 'Location 139', 'Location 125', 'Location 181'],
      dtype=object)

In [13]:
data = pd.Series({"Product A":1234,"Product B":3435,"Product C":1200})
data

Product A    1234
Product B    3435
Product C    1200
dtype: int64

In [17]:
data.index.to_numpy()

array(['Product A', 'Product B', 'Product C'], dtype=object)

In [22]:
type(data.to_numpy())

numpy.ndarray

In [44]:
d4 = pd.Series([1,2,3,4])
d4

0    1
1    2
2    3
3    4
dtype: int64

In [30]:
d2 = pd.Series([{'a':2},{'b':2}])
d2

0    {'a': 2}
1    {'b': 2}
dtype: object

In [31]:
d3 = pd.DataFrame(d2)
d3

          0
0  {'a': 2}
1  {'b': 2}

In [45]:
d5 = pd.read_csv("365DSc-GNI-pd.csv")
d6 = d5.copy()
d6

,CountryName,Year,YearCode,"GNIPerCapita,(current US$)",MerchandiseTrade (% of GDP),LandArea(sq. km)
0,Afghanistan,2004,YR2004,210,43.46178,652290.0
1,Afghanistan,2005,YR2005,240,41.84058,652290.0
2,Afghanistan,2006,YR2006,280,38.67088,652290.0
3,Afghanistan,2007,YR2007,310,34.10960,652290.0
4,Afghanistan,2008,YR2008,300,29.76439,652290.0
...,...,...,...,...,...,...
818,Zimbabwe,2006,YR2006,440,79.10754,386680.0
819,Zimbabwe,2007,YR2007,420,93.65830,386680.0
820,Zimbabwe,2008,YR2008,350,116.74920,386680.0
821,Zimbabwe,2009,YR2009,410,88.68595,386680.0
822,Zimbabwe,2010,YR2010,490,84.38971,386680.0

In [51]:
d6.loc[:,'CountryName'].iloc[264]

'Greece'

In [66]:
d6["CountryName"].unique()

array(['Afghanistan', 'Algeria', 'Argentina', 'Belgium',
       'Bosnia and Herzegovina', 'Brazil', 'Bulgaria', 'Burundi',
       'Canada', 'Chile', 'China', 'Cuba', 'Cyprus', 'Czech Republic',
       'Denmark', 'Ecuador', 'Egypt, Arab Rep.', 'Estonia', 'Ethiopia',
       'Finland', 'France', 'Gambia, The', 'Germany', 'Ghana', 'Greece',
       'Guatemala', 'Hungary', 'Iceland', 'India', 'Indonesia', 'Iraq',
       'Israel', 'Italy', 'Jamaica', 'Japan', 'Kazakhstan', 'Kenya',
       'Korea, Rep.', 'Kuwait', 'Latvia', 'Lebanon', 'Libya', 'Lithuania',
       'Luxembourg', 'Madagascar', 'Malaysia', 'Maldives', 'Mali',
       'Malta', 'Montenegro', 'Morocco', 'Mozambique', 'Nigeria',
       'Norway', 'Pakistan', 'Qatar', 'Romania', 'Serbia', 'Singapore',
       'Slovak Republic', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Sweden', 'Switzerland', 'Tajikistan', 'Togo',
       'Trinidad and Tobago', 'Uganda', 'Ukraine', 'United Arab Emirates',
       'United Kingdom', 'United States', 'Uruguay', 'Uzbekistan',
       'Vietnam', 'Zimbabwe'], dtype=object)

In [70]:
(pd.Series(["b","a","z"])).max

<bound method NDFrame._add_numeric_operations.<locals>.max of 0    b
1    a
2    z
dtype: object>